cf/Catalogs/НастройкиДоступаБюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступаБюджетирование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапретаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиБюджета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/НастройкиДоступаБюджетирование/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Для Каждого Стр Из Отделы Цикл 
		//Свойство=Стр.свойство;
		//Значение=Стр.значение;
        ОбновитьСвойство(Сценарий, Пользователь,Стр.Отдел);
	КонецЦикла;
	
	Для Каждого Стр Из СтатьиБюджета Цикл 
		//Свойство=Стр.свойство;
		//Значение=Стр.значение;
        ОбновитьСвойство(Сценарий, Пользователь,Стр.СтатьяБюджета);
    КонецЦикла;
КонецПроцедуры


//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//    Для Каждого Стр Из Объект.Свойства Цикл 
//        Свойство=Стр.свойство;
//        Значение=Стр.значение;
//        ОбновитьСвойство(Объект, Свойство,Значение);
//    КонецЦикла;
//КонецПроцедуры

&НаСервере
Процедура ОбновитьСвойство(Сценарий, Свойство, ОбъектДоступа);
    Запись = РегистрыСведений.НастройкиДоступаБюджетированиеСоздатьМенеджерЗаписи();
    Запись.Сценарий = Сценарий;
    Запись.Пользователь = Пользователь;
    Запись.ОбъектДоступа = ОбъектДоступа;
    Запись.Записать();
 КонецПроцедуры
